{
  "schedule": {
    "2018-11-23": {
      "dateReadable": "November 23",
      "tracks": [
        {
          "title": "Track One"
        },
        {
          "title": "Track Two"
        },
        {
          "title": "Track A"
        }
      ],
      "timeslots": [
        {
          "startTime": "08:00",
          "endTime": "09:00",
          "sessions": [
            {
              "items": [
                "registration"
              ]
            }
          ]
        },
        {
          "startTime": "09:00",
          "endTime": "09:30",
          "sessions": [
            {
              "items": [
                "commit10"
              ]
            }
          ]
        },
        {
          "startTime": "09:30",
          "endTime": "09:45",
          "sessions": [
            {
              "items": [
                "ibmwatson"
              ]
            }
          ]
        },
        {
          "startTime": "10:00",
          "endTime": "10:45",
          "sessions": [
            {
              "items": [
                "forodatakarma",
                "nodejsowasp",
                "postgresqldelicatessen"
              ]
            }
          ]
        },
        {
          "startTime": "11:00",
          "endTime": "11:40",
          "sessions": [
            {
              "items": [
                "transaccionesmicro",
                "uxguerrilla",
                "postgresqldelicatessen"
              ]
            }
          ]
        }
      ]
    },
    "2018-11-24": {
      "dateReadable": "November 24",
      "tracks": [
        {
          "title": "Track One"
        },
        {
          "title": "Track Two"
        },
        {
          "title": "Track A"
        }
      ],
      "timeslots": [
        {
          "startTime": "08:00",
          "endTime": "09:00",
          "sessions": [
            {
              "items": [
                "registration"
              ]
            }
          ]
        }
      ]
    }
  },
  "sessions": {
    "registration": {
      "title": "REGISTRATION",
      "description": ""
    },
    "commit10": {
      "title": "Commit 1.0",
      "description": ""
    },
    "ibmwatson": {
      "title": "IBM: IA más allá de Watson",
      "description": "Si en IBM nos destacamos en algo eso es en formar parte activa de la innovación, con más de 3000 investigadores, repartidos en 12 laboratorios de los 6 contienentes. En este charla os eseñaremos un trocito del futuro en el que estamos investigando, un futuro muy ligado a la Inteligencia Artificial. Os enseñaremos un futuro que podreis ver, tocar y que se encuentran más cerca de la ciencia ficción que de la realidad."
    },
    "forodatakarma": {
      "title": "Foro data karma: cuando los datos y el IA se encuentran",
      "description": "El 17 de marzo de 2018 The New York Times, The Guardian y The Observer denunciaron que la empresa Cambridge Analytica estaba explotando información de 50 millones de usuarios de Facebook. La noticia más controvertida al respecto fue la utilización de esa información para la campaña de Trump: cómo se utilizaron los datos para persuadir a los indecisos y de esta forma favorecer en voto.\n\nActualmente, generamos altos volúmenes de datos. Desde hace décadas las empresas los están utilizando para mejorar sus procesos de negocio. Se han descubierto varias vías: mejorar la vida de los usuarios / clientes, personalizar la información o segmentar tipos de clientes interesantes para otras empresas.\n\nDurante ese proceso de recolección de datos, procesamiento y análisis nos entran muchas dudas e incertidumbre. *¿Cómo se obtienen los datos? ¿Cómo de privados son? ¿Qué empresas utilizan mis datos sin saberlo? ¿Cómo son los algoritmos que procesan los datos? ¿Cuándo desaparecerán los puestos de trabajo? *\n\nContaremos con las expertas en BD & IA Inés Huertas, Nerea Luis y Bea Zigiella junto a la moderadora Laura Lacarra para debatir sobre nuestras opiniones en este campo. Abriremos el debate a los asistentes y así sacar más conclusiones sobre este tema preocupante.",
      "tags": [ "Talk", "Spanish", "Beginner", "Big Data;Machine Learning", "None" ]
    },
    "transaccionesmicro": {
      "title": "Transacciones en microservicios... ¿Mito o realidad?",
      "description": "Una de las problemáticas más comunes que nos encontramos al trabajar con una arquitectura basada en microservicios es el tratamiento de la transaccionalidad.\n\nUn problema generalmente resuelto en el mundo monolítico se convierte en un desafío en las arquitecturas distribuidas. ¿Cómo podemos atacar esta necesidad transaccional de forma eficiente?\n\nEn esta charla estudiaremos técnicas y patrones habituales (CQRS, event sourcing, lectura de logs transaccionales...) que nos ayudarán a gestionarla.\n\nLa charla será teórico práctica con ejemplos sobre las técnicas analizadas.",
      "tags": [ "Talk", "Spanish", "Advanced", "Cloud", "Java;Go" ]
    },
    "nodejsowasp": {
      "title": "Desarrollo seguro en NodeJS (OWASP top ten y buenas prácticas en JWT)!",
      "description": "En esta charla veremos las vulnerabilidades de la lista OWASP top ten de 2017 y como evitarlas en NodeJS. Además también veremos buenas prácticas para segurizar nuestras apis utilizando JWT y JWKS.",
      "tags": [ "Talk", "Spanish", "Intermediate", "Security;Web", "Javascript" ]
    },
    "postgresqldelicatessen": {
      "title": "PostgreSQL Delicatessen: Top 10 features you don't know about",
      "description": "If you want to go beyond using PostgreSQL as a plain repository of data, not just relying on your ORM or any other middleware, but instead taking the best and most modern features of your favourite database, this workshop is for you.\n\nOn this talk we want to present in an interactive and practical way a few interesting not so well known features from the best open source relational database, PostgreSQL.\n\nWe will see how to:\n\nIntegrate PostgreSQL with external big data repositories such as MongoDB (yes MongoDB, sorry for the stroke), BigQuery, Hive or Impala and join the best of two worlds.\nRun Python code inside the database for complex logic such as machine learning algorithms.\nFinally understand window functions to make amazing aggregations.\nVisually explore the execution plan of your queries to optimize performance.\nCreate interactive geospatial visualizations with SQL and WebGL\nCreate and share SQL notebooks\n...and much much more (well it will depend on how much time do we have but you get the idea)\n\nWe will provide lots of material for the workshop and it will be entirely done on the cloud, so you don’t even need to have an instance of PostgreSQL running on your laptop (of course if you want you still can).",
      "tags": [ "workshop", "English", "Intermediate", "Soft skills;SQL and NOSQL;Big Data;Web", "HTML/CSS;Javascript;Python;Other" ]
    }
  },
  "speakers": {
    "mxsash" : {
      "name" : "Sasha Romijn",
      "country" : "Django // The Netherlands",
      "featured" : true,

      "company" : "Django Software Foundation",
      "title" : "Security Team",

      "photoUrl" : "/images/people/speakers/mxsash.jpg",

      "shortBio" : "Distributor of stroopwafel-based happiness and Python code.",
      "bio" : "Sasha is the co-founder and CTO of a Django development company in Amsterdam. She is deeply involved in the community around Django, a popular Python web framework, being a Django team member, chair of the Dutch Django Association and co-organiser of various conferences. She cares about building communities and conferences in which everyone feels welcome, valued and at home, regardless of their background. Sasha has a specific interest in well-being and ethical issues around communities and development. Some of her side projects are the Less Obvious Conference Checklist, with many less obvious suggestions for event organisers, and Happiness Packets, to spread more gratitude and kindness in open source communities.",

      "socials" : [ {
        "icon" : "twitter",
        "link" : "https://twitter.com/mxsash",
        "name" : "Twitter"
      } ]
    }
  }
}